{
  "interviewData": [
    {
      "title": "What is JavaScript?",
      "desc": "JavaScript is a high-level programming language used to create dynamic and interactive web pages.",
      "details": [
        "JavaScript is a lightweight, high level & interpreted programming language (just-in-time line by line compiltion).",
        "It allows you to build interactivity into otherwise static HTML pages.",
        "JavaScript is case-sensitive language.",
        "It has curly -brakcets syntax, dynamic typing, prototype-based object-oriented capabilities & first class functions."
      ]
    },
    {
      "title": "Explain the difference between let, const, and var?",
      "desc": "let and const have block scope and are block-level declarations, while var has function scope and can be re-declared and updated within the same function.",
      "details": [
        "user can declare varibale using these 3 keywords.",
        "Var is a function scoped where both let and const have block scope.",
        "var once declared can be re-declared with same name and its value can be re-assign.",
        "let once declared can not be redecalred again with same name and its value can be re-assign.",
        "const have to declared & it must assign a value at the time of declration & it cannot be re-assign.",
        "let & const hosited in temperal dead zone before it get initilized.",
        "var is assigned with undescined value when hoisted."
      ]
    },
    {
      "title": "How does hoisting work in JavaScript?",
      "desc": "Hoisting is JavaScript's descault behavior of moving declarations to the top of the current scope, allowing functions and variables to be used before they are declared.",
      "details": [
        "In hoisting, the JS engine works behind the scenes to move the variable and function declarations to the top.",
        "Hoisting is JavaScript's descault behavior of moving declarations to the top of the current scope",
        "Hoisting applies to variable declarations and to function declarations.",
        "Because of this, JavaScript functions can be called before they are declared"
      ]
    },
    {
      "title": "Describe the concept of closures?",
      "desc": "A closure is a function that has access to the variables from outer (or parent) functions even after the outer function has finished executing.",
      "details": [
        "JavaScript variables can belong to the local or global scope.",
        "Global variables can be made local (private) with closures.",
        "A function can access all variables descined inside the function"
      ]
    },
    {
      "title": "Explain the event loop in JavaScript?",
      "desc": "The event loop is a mechanism used by JavaScript runtime environments to manage asynchronous code execution by continuously monitoring the call stack and task queue.",
      "details": [
        "The event loop is a mechanism used by JavaScript runtime environments to manage asynchronous code execution."
      ]
    },
    {
      "title": "What is the difference between == and ===?",
      "desc": "The == operator checks for equality after converting operands to a common type, while the === operator checks for equality without type conversion.",
      "details": []
    },
    {
      "title": "How do you check the type of a variable in JavaScript?",
      "desc": "The typeof operator is used to check the type of a variable in JavaScript.",
      "details": []
    },
    {
      "title": "What is the use of the this keyword in JavaScript?",
      "desc": "In JavaScript, the this keyword refers to the current execution context or object.",
      "details": [
        "In JavaScript, the this keyword refers to an object.",
        "Which object depends on how this is being invoked (used or called).",
        "The this keyword refers to different objects depending on how it is used:"
      ]
    },
    {
      "title": "Explain the difference between function declaration and function expression.",
      "desc": "A function declared using var, let or const is hoisted while a function expression is not.",
      "details": []
    },
    {
      "title": "How does the setTimeout function work?",
      "desc": "The setTimeout() function in JavaScript allows you to execute a piece of code after a certain amount of time has passed.",
      "details": [
        "The setTimeout() function is asynchronous, meaning that it does not block the execution of the current function. Instead, it schedules the callback function to be executed at a later time."
      ]
    },
    {
      "title": "What is a callback function?",
      "desc": "A callback function is a function that is passed as an argument to another function and is executed after the parent function has completed execution.",
      "details": [
        "A callback is a function passed to some method as argument to another function.",
        "callback function runs after another function has finished hence name is callback function."
      ]
    },
    {
      "title": "Explain the concept of a pure function.",
      "desc": "A pure function is a function that given the same input will always return the same output and does not have any observable side effects.",
      "details": []
    },
    {
      "title": "Describe the differences between function.call, function.apply, and function.bind.",
      "desc": "function.call and function.apply are methods used to invoke a function with a specified this value and arguments, while function.bind returns a new function with a pre-set this value and partially applied arguments.",
      "details": []
    },
    {
      "title": "What is the purpose of the arguments object in a function?",
      "desc": "The arguments object in a function provides access to the arguments passed to the function.",
      "details": []
    },
    {
      "title": "How do you create a closure in JavaScript?",
      "desc": "A closure is created in JavaScript when a function has access to variables from its outer (enclosing) function, even after the outer function has returned.",
      "details": []
    },
    {
      "title": "What is the use of the bind method?",
      "desc": "The bind method in JavaScript is used to create a new function with a specified this value and partially applied arguments.",
      "details": []
    },
    {
      "title": "What is the difference between a shallow copy and a deep copy?",
      "desc": "A shallow copy creates a new object with the same properties as the original object, while a deep copy creates a new object with a new copy of the values of the original object's properties.",
      "details": []
    },
    {
      "title": "How does the call stack work in JavaScript?",
      "desc": "The call stack is a data structure used by the JavaScript engine to keep track of the currently executing function and its context.",
      "details": []
    },
    {
      "title": "Explain the concept of function currying.",
      "desc": "Function currying is a technique in JavaScript where a function is transformed to return a new function that accepts the remaining arguments.",
      "details": []
    },
    {
      "title": "How can you avoid callback hell in JavaScript?",
      "desc": "Callback hell can be avoided in JavaScript by using promises, async/await, or higher-order functions like map, reduce, and filter.",
      "details": []
    },
    {
      "title": "What is prototypal inheritance?",
      "desc": "Prototypal inheritance is a mechanism in JavaScript where objects inherit properties and methods from other objects.",
      "details": []
    },
    {
      "title": "How do you create an object in JavaScript?",
      "desc": "Objects in JavaScript can be created using object literals, constructor functions, or object.create() method.",
      "details": []
    },
    {
      "title": "What is the purpose of the prototype property in JavaScript?",
      "desc": "The prototype property in JavaScript is used to add properties and methods to constructor functions and their instances.",
      "details": []
    },
    {
      "title": "Explain the difference between Object.create and the constructor pattern.",
      "desc": "Object.create creates a new object with a specified prototype and properties, while the constructor pattern creates a new object with a constructor function and its prototype.",
      "details": []
    },
    {
      "title": "How do you add a property to an object in JavaScript?",
      "desc": "A property can be added to an object in JavaScript using dot notation or bracket notation.",
      "details": []
    },
    {
      "title": "What is the hasOwnProperty method used for?",
      "desc": "The hasOwnProperty method in JavaScript is used to check if an object has a specific property as its own property, not inherited from its prototype chain.",
      "details": []
    },
    {
      "title": "How can you prevent modification of object properties in JavaScript?",
      "desc": "Object properties in JavaScript can be prevented from modification using Object.freeze() method.",
      "details": []
    },
    {
      "title": "Describe the use of the new keyword.",
      "desc": "The new keyword in JavaScript is used to create a new instance of a constructor function and bind its this value to the new object.",
      "details": []
    },
    {
      "title": "Explain the concept of Object Destructuring in JavaScript.",
      "desc": "Object destructuring in JavaScript is a syntax for unpacking values from objects and assigning them to variables.",
      "details": []
    },
    {
      "title": "What is the difference between null and undescined?",
      "desc": "Null is an intentional absence of any object value, while undescined is a value that represents an uninitialized or non-existent variable or property.",
      "details": []
    },
    {
      "title": "What is the DOM?",
      "desc": "The DOM (Document Object Model) is a programming interface for HTML and XML documents that represents the document as a tree of nodes and objects.",
      "details": []
    },
    {
      "title": "How do you select elements with Vanilla JavaScript?",
      "desc": "Elements in the DOM can be selected using methods like document.getElementById(), document.getElementsByClassName(), document.querySelector(), and document.querySelectorAll().",
      "details": []
    },
    {
      "title": "Explain event delegation in JavaScript.",
      "desc": "Event delegation in JavaScript is a technique where an event listener is added to a parent element instead of individual child elements, allowing the event to be captured and handled by the parent element.",
      "details": []
    },
    {
      "title": "What is the purpose of the addEventListener method?",
      "desc": "The addEventListener method in JavaScript is used to attach an event listener to an element, allowing the element to respond to specific events like click, mouseover, or keydown.",
      "details": []
    },
    {
      "title": "How do you create and remove elements in the DOM?",
      "desc": "Elements can be created in the DOM using methods like document.createElement(), document.createTextNode(), and element.cloneNode(), and can be removed using element.remove() or parentNode.removeChild().",
      "details": []
    },
    {
      "title": "Explain the concept of event propagation.",
      "desc": "Event propagation in JavaScript is the process of events bubbling up or capturing down the DOM tree, allowing multiple elements to respond to the same event.",
      "details": []
    },
    {
      "title": "What is the purpose of addEventListener method?",
      "desc": "The addEventListener method is used attach an event handler to an element, allowing you to respond to user interactions or other events.",
      "details": []
    },
    {
      "title": "How do you create and remove elements in the DOM?",
      "desc": "To create an element in the DOM, you can use document.createElement() and then append it to the parent node using appendChild(). To remove an element, you can call removeChild() on the parent node.",
      "details": []
    },
    {
      "title": "Explain the concept of event propagation.",
      "desc": "Event propagation is the concept that describes how events bubble up through the DOM tree, allowing event handlers to be attached to parent elements and still respond to events that occur on child elements.",
      "details": []
    },
    {
      "title": "How can you prevent the descault behaviour of an event?",
      "desc": "To prevent the descault behavior of an event, you can call the preventdescault() method on the event object, which stops the browser from performing its descault action for that event.",
      "details": []
    },
    {
      "title": "What is the purpose of the data- attribute in HTML?",
      "desc": "The data- attribute in HTML is used to store custom data private to the page or application, allowing you to add arbitrary data to HTML elements without affecting their behavior or styling.",
      "details": []
    },
    {
      "title": "Describe the difference between innerHTML and textContent.",
      "desc": "innerHTML sets or gets the HTML content of an element, including tags and formatting, while textContent sets or gets the text content of an element, without any HTML tags or formatting.",
      "details": []
    },
    {
      "title": "How do you handle asynchronous code in JavaScript?",
      "desc": "To handle asynchronous code in JavaScript, you can use callbacks, promises, or async/await syntax, which allow you to execute code that depends on the completion of other tasks without blocking the rest of the application.",
      "details": []
    },
    {
      "title": "what is promises?",
      "desc": "A Promise is an object that represents the eventual completion or failure of an asynchronous operation. Promises are used to handle asynchronous operations in a more efficient and manageable way.",
      "details": [
        "A Promise is an object that represents the eventual completion or failure of an asynchronous operation",
        "Promises are used to handle asynchronous operations in a more efficient and manageable way.",
        "Promises can be created using the Promise constructor. The Promise constructor takes a function as its argument, which is called the executor function. The executor function is responsible for performing the asynchronous operation and resolving or rejecting the promise.",
        "Once a promise is created, it can be used to handle the completion or failure of the asynchronous operation. This can be done using the then() and catch() methods. The then() method is used to handle the completion of the promise, and the catch() method is used to handle the failure of the promise."
      ]
    },
    {
      "title": "what is fetch in javascript?",
      "desc": "The Fetch API uses promises, which makes it easier to handle asynchronous operations.",
      "details": [
        "To use the Fetch API, you can use the fetch() function. The fetch() function takes a URL as its argument and returns a promise.",
        "The promise will resolve to a Response object, which represents the response to the network request."
      ]
    },
    {
      "title": "Difference between Fetch and Promise",
      "desc": " Fetch is specifically designed for making network requests, while Promise can be used for any type of asynchronous operation.",
      "details": [
        "Fetch uses promises to handle asynchronous operations, while Promise can be used to handle asynchronous operations from any source.",
        " Fetch is a newer API that is designed to be easier to use than the older XMLHttpRequest API ",
        "Promise is an object that represents the eventual completion or failure of an asynchronous operation."
      ]
    }
  ]
}
